Change lines in docker-compose.yml
backend: "- REQUEST_ORIGIN=http://localhost:5000" -> "- REQUEST_ORIGIN=http://localhost"
frontend: "- REACT_APP_BACKEND_URL=http://localhost:8080" -> "- REACT_APP_BACKEND_URL=http://localhost/api"